#Day 8

In [4]:
import numpy as np
import pandas as pd

In [2]:
lables=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30,40])
d={'a':10, 'b':20, 'c':30}

In [7]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [8]:
arr

array([10, 20, 30, 40])

In [9]:
pd.Series(my_list,lables)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(arr)

0    10
1    20
2    30
3    40
dtype: int32

In [12]:
s1=pd.Series([1,2,3,4], index=['USA','GERMANY','USSR','JAPAN'])

In [13]:
s1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [23]:
s2=pd.Series([1,2,3,4], index=['INDIA','GERMANY','USA','JAPAN'])

In [24]:
s2

INDIA      1
GERMANY    2
USA        3
JAPAN      4
dtype: int64

In [16]:
s1['USA']

1

In [21]:
s1[1]

2

In [25]:
s1+s2

GERMANY    4.0
INDIA      NaN
JAPAN      8.0
USA        4.0
USSR       NaN
dtype: float64

In [30]:
from numpy.random import randn
np.random.seed(101)

In [ ]:
df=pd.DataFrame()

In [44]:
import numpy as np
import pandas as pd

#missing Data

In [45]:
d={'A':[1,2,np.nan], 'B':[np.nan,3,np.nan],'C':[np.nan,4,np.nan],'D':[5,6,7]}

In [46]:
d

{'A': [1, 2, nan], 'B': [nan, 3, nan], 'C': [nan, 4, nan], 'D': [5, 6, 7]}

In [47]:
df=pd.DataFrame(data=d)

In [48]:
df

     A    B    C  D
0  1.0  NaN  NaN  5
1  2.0  3.0  4.0  6
2  NaN  NaN  NaN  7

In [14]:
#[1] First Methods to hande this missing data is to drop all missing data.

df.dropna(axis=0) #axis=0 will drop missing values for rows(Default)

     A    B    C  D
1  2.0  3.0  4.0  6

In [15]:
df.dropna(axis=1) #axis=1 will drop missing values for Columns

   D
0  5
1  6
2  7

In [17]:
#[2] Second Mathod most of the time we want to fill/replace this missing data and not remove them.

df.fillna(value='FILL')

      A     B     C  D
0   1.0  FILL  FILL  5
1   2.0   3.0   4.0  6
2  FILL  FILL  FILL  7

In [18]:

df.fillna(value=100)

       A      B      C  D
0    1.0  100.0  100.0  5
1    2.0    3.0    4.0  6
2  100.0  100.0  100.0  7

In [19]:
# say you want to fill a particular column NaN with a value i.e. not an entire dataset

df

     A    B    C  D
0  1.0  NaN  NaN  5
1  2.0  3.0  4.0  6
2  NaN  NaN  NaN  7

In [35]:
df['A'].fillna(value='FIll')

0     1.0
1     2.0
2    fill
Name: A, dtype: object

In [26]:
df

      A    B    C  D
0   1.0  NaN  NaN  5
1   2.0  3.0  4.0  6
2  fill  NaN  NaN  7

In [33]:
# loc and iloc (Rows)
#if you want to fill replace a particular row Nan with a value, so for this row we use loc and iloc.
#loc is used for Labeled Index and iloc is used for numeric/integer index.

df.iloc[0].fillna(value='fill1')

A      1.0
B    fill1
C    fill1
D        5
Name: 0, dtype: object

In [41]:
df

      A    B    C  D
0   1.0  NaN  NaN  5
1   2.0  3.0  4.0  6
2  fill  NaN  NaN  7

In [49]:
# A is column & i want to replace this NaN by mean 1+2/2

df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [50]:

df['A'].fillna(value=df['A'].sum())

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

In [52]:
df.iloc[0].fillna(value=df.iloc[0].sum())

A    1.0
B    6.0
C    6.0
D    5.0
Name: 0, dtype: float64

In [54]:
df1=pd.DataFrame(data=d,index=['x','y','z'])

In [55]:
df1

     A    B    C  D
x  1.0  NaN  NaN  5
y  2.0  3.0  4.0  6
z  NaN  NaN  NaN  7

In [58]:
df1.loc['x'].fillna(value='mi')

A    1.0
B     mi
C     mi
D    5.0
Name: x, dtype: object

In [59]:
#group by : concept says we will create categories and then will apply functions over this category.

data1={'Name':['Rahul','Amar','Pooja','Amar','Rahul','Pooja'],
      'Subjects':['Maths','Chemistry','Physics','Maths','Chemistry','Maths'],
       'Marks':[60,40,40,90,40,50]
      }

In [60]:
data1

{'Name': ['Rahul', 'Amar', 'Pooja', 'Amar', 'Rahul', 'Pooja'],
 'Subjects': ['Maths', 'Chemistry', 'Physics', 'Maths', 'Chemistry', 'Maths'],
 'Marks': [60, 40, 40, 90, 40, 50]}

In [61]:
df2=pd.DataFrame(data=data1)

In [62]:
df2

    Name   Subjects  Marks
0  Rahul      Maths     60
1   Amar  Chemistry     40
2  Pooja    Physics     40
3   Amar      Maths     90
4  Rahul  Chemistry     40
5  Pooja      Maths     50

In [64]:
gb_df=df2.groupby('Name') #an object at memory location

In [65]:
gb_df

In [66]:
gb_df.groups # we are groupping it in a category

{'Amar': [1, 3], 'Pooja': [2, 5], 'Rahul': [0, 4]}

In [67]:
# So we are grouping in a category and will apply function

gb_df.sum()

       Marks
Name
Amar     130
Pooja     90
Rahul    100

In [68]:
gb_df.mean()

       Marks
Name
Amar      65
Pooja     45
Rahul     50

In [71]:
gb_df.std()

           Marks
Name
Amar   35.355339
Pooja   7.071068
Rahul  14.142136

In [72]:
gb_df.max()

      Subjects  Marks
Name
Amar     Maths     90
Pooja  Physics     50
Rahul    Maths     60

In [73]:
gb_df.min()

        Subjects  Marks
Name
Amar   Chemistry     40
Pooja      Maths     40
Rahul  Chemistry     40

In [74]:
df2.groupby('Name').count()

       Subjects  Marks
Name
Amar          2      2
Pooja         2      2
Rahul         2      2

In [78]:
df2.groupby('Name').describe()

      Marks
      count  mean        std   min   25%   50%   75%   max
Name
Amar    2.0  65.0  35.355339  40.0  52.5  65.0  77.5  90.0
Pooja   2.0  45.0   7.071068  40.0  42.5  45.0  47.5  50.0
Rahul   2.0  50.0  14.142136  40.0  45.0  50.0  55.0  60.0

In [81]:
df2.groupby('Name').describe().transpose()

Name              Amar      Pooja      Rahul
Marks count   2.000000   2.000000   2.000000
      mean   65.000000  45.000000  50.000000
      std    35.355339   7.071068  14.142136
      min    40.000000  40.000000  40.000000
      25%    52.500000  42.500000  45.000000
      50%    65.000000  45.000000  50.000000
      75%    77.500000  47.500000  55.000000
      max    90.000000  50.000000  60.000000

In [87]:
df2.groupby(['Name','Subjects']).describe()

                Marks
                count  mean std   min   25%   50%   75%   max
Name  Subjects
Amar  Chemistry   1.0  40.0 NaN  40.0  40.0  40.0  40.0  40.0
      Maths       1.0  90.0 NaN  90.0  90.0  90.0  90.0  90.0
Pooja Maths       1.0  50.0 NaN  50.0  50.0  50.0  50.0  50.0
      Physics     1.0  40.0 NaN  40.0  40.0  40.0  40.0  40.0
Rahul Chemistry   1.0  40.0 NaN  40.0  40.0  40.0  40.0  40.0
      Maths       1.0  60.0 NaN  60.0  60.0  60.0  60.0  60.0

In [90]:
df2.groupby(['Name','Subjects'])['Amar']

KeyError: 'Column not found: Amar'

In [88]:
df2.groupby(['Name','Subjects']).describe().transpose()['Amar']

Subjects     Chemistry  Maths
Marks count        1.0    1.0
      mean        40.0   90.0
      std          NaN    NaN
      min         40.0   90.0
      25%         40.0   90.0
      50%         40.0   90.0
      75%         40.0   90.0
      max         40.0   90.0

#Merge

In [111]:
df2a=pd.DataFrame({'Name':['Rahul','Tina','Sam'],
                 'City':['Jodhpur','Jaipur','Pune']})

In [94]:
df2a

    Name     City
0  Rahul  Jodhpur
1   Tina   Jaipur
2    Sam     Pune

In [117]:
df2b=pd.DataFrame({'Name':['Rahul','Tina1','Sam1'],
                 'Marks':[45,68,79]})

In [118]:
df2b

    Name  Marks
0  Rahul     45
1  Tina1     68
2   Sam1     79

In [119]:
df3=pd.merge(df2a,df2b,on='Name',how='outer')

In [120]:
df3

    Name     City  Marks
0  Rahul  Jodhpur   45.0
1   Tina   Jaipur    NaN
2    Sam     Pune    NaN
3  Tina1      NaN   68.0
4   Sam1      NaN   79.0

In [127]:
df3=pd.merge(df2a,df2b,on='Name',how='inner')

In [128]:
df3

    Name     City  Marks
0  Rahul  Jodhpur     45

In [131]:
df3=pd.merge(df2a,df2b,on='Name',how='right')

In [132]:
df3

    Name     City  Marks
0  Rahul  Jodhpur     45
1  Tina1      NaN     68
2   Sam1      NaN     79

In [133]:
df3=pd.merge(df2a,df2b,on='Name',how='left')

In [134]:
df3

    Name     City  Marks
0  Rahul  Jodhpur   45.0
1   Tina   Jaipur    NaN
2    Sam     Pune    NaN

In [135]:
df3=pd.merge(df2a,df2b,on='Name',how='outer',indicator=True)

In [136]:
df3

    Name     City  Marks      _merge
0  Rahul  Jodhpur   45.0        both
1   Tina   Jaipur    NaN   left_only
2    Sam     Pune    NaN   left_only
3  Tina1      NaN   68.0  right_only
4   Sam1      NaN   79.0  right_only

In [137]:
df1a=pd.DataFrame({'Name':['Rahul','Tina1','Sam1','Pooja'],
                   'City':['Jodhpur','Kota','Surat','Nashik']})

In [138]:
df1a

    Name     City
0  Rahul  Jodhpur
1  Tina1     Kota
2   Sam1    Surat
3  Pooja   Nashik

In [139]:
df1b=pd.DataFrame({'Name':['Rahul','Tina1','Sameer','Pooja'],
                   'City':['Jodhpur','Kota','Surat','Nashik']})

In [140]:
df1b

     Name     City
0   Rahul  Jodhpur
1   Tina1     Kota
2  Sameer    Surat
3   Pooja   Nashik

In [141]:
df3=pd.merge(df1a,df1b,on='City')

In [142]:
df3

  Name_x     City  Name_y
0  Rahul  Jodhpur   Rahul
1  Tina1     Kota   Tina1
2   Sam1    Surat  Sameer
3  Pooja   Nashik   Pooja

In [143]:
df3=pd.merge(df1a,df1b,on='City',suffixes=('_df1a','_df1b'))

In [144]:
df3

  Name_df1a     City Name_df1b
0     Rahul  Jodhpur     Rahul
1     Tina1     Kota     Tina1
2      Sam1    Surat    Sameer
3     Pooja   Nashik     Pooja

In [ ]:
# Concate used for Joining two or more data frame

In [146]:
df1a=pd.DataFrame({'Name':['Rahul','Tina1','Sam1'],
                   'City':['Jodhpur','Kota','Pune']})

In [147]:
df1b=pd.DataFrame({'Name':['Rahul','Tina1','Sam'],
                   'City':['Ajmer','Goa','pune']})

In [148]:
df1a

    Name     City
0  Rahul  Jodhpur
1  Tina1     Kota
2   Sam1     Pune

In [149]:
df1b

    Name   City
0  Rahul  Ajmer
1  Tina1    Goa
2    Sam   pune

In [151]:
df0=pd.concat([df1a,df1b])

In [152]:
df0

    Name     City
0  Rahul  Jodhpur
1  Tina1     Kota
2   Sam1     Pune
0  Rahul    Ajmer
1  Tina1      Goa
2    Sam     pune

In [154]:
df0=pd.concat([df1a,df1b],ignore_index=True)

In [155]:
df0

    Name     City
0  Rahul  Jodhpur
1  Tina1     Kota
2   Sam1     Pune
3  Rahul    Ajmer
4  Tina1      Goa
5    Sam     pune

In [160]:
df0=pd.concat([df1a,df1b],keys=['T1','T2'])

In [161]:
df0

       Name     City
T1 0  Rahul  Jodhpur
   1  Tina1     Kota
   2   Sam1     Pune
T2 0  Rahul    Ajmer
   1  Tina1      Goa
   2    Sam     pune

In [163]:
df0.loc['T1'] #loc is user for Labelled index and iloc is used for Numeria index

    Name     City
0  Rahul  Jodhpur
1  Tina1     Kota
2   Sam1     Pune

In [164]:
df0.loc['T2']

    Name   City
0  Rahul  Ajmer
1  Tina1    Goa
2    Sam   pune

In [165]:
df1c=pd.DataFrame({'Name':['Rahul','Tina1','Sam1'],
                   'City':['Jodhpur','Jaipur','Pune']})

In [166]:
df1c

    Name     City
0  Rahul  Jodhpur
1  Tina1   Jaipur
2   Sam1     Pune

In [167]:
df1d=pd.DataFrame({'Name':['Rahul','Tina1','Sam1'],
                   'Marks':[78,12,78]})

In [168]:
df1d

    Name  Marks
0  Rahul     78
1  Tina1     12
2   Sam1     78

In [170]:
dfa=pd.concat([df1c,df1d])
dfa

    Name     City  Marks
0  Rahul  Jodhpur    NaN
1  Tina1   Jaipur    NaN
2   Sam1     Pune    NaN
0  Rahul      NaN   78.0
1  Tina1      NaN   12.0
2   Sam1      NaN   78.0

In [171]:
dfa=pd.concat([df1c,df1d],axis=1) #default axis=0
dfa

    Name     City   Name  Marks
0  Rahul  Jodhpur  Rahul     78
1  Tina1   Jaipur  Tina1     12
2   Sam1     Pune   Sam1     78

In [175]:
names=pd.DataFrame({'Name':['Rahul','Tina1','Sam1'],
                   'Marks':[78,12,78]})

In [173]:
s=pd.Series(['A','B','C','D'],name='Grade')
s

0    A
1    B
2    C
3    D
Name: Grade, dtype: object

In [179]:
df0=pd.concat([names,s],axis=0)
df0

     0  Marks   Name
0  NaN   78.0  Rahul
1  NaN   12.0  Tina1
2  NaN   78.0   Sam1
0    A    NaN    NaN
1    B    NaN    NaN
2    C    NaN    NaN
3    D    NaN    NaN

In [180]:
df0=pd.concat([names,s],axis=1)
df0

    Name  Marks Grade
0  Rahul   78.0     A
1  Tina1   12.0     B
2   Sam1   78.0     C
3    NaN    NaN     D

In [181]:
#pandas Operations

df=pd.DataFrame({'a1':[10,20,10],'a2':[10,30,60],'a3':[60,10,90]})
df

   a1  a2  a3
0  10  10  60
1  20  30  10
2  10  60  90

In [182]:
df.columns # to get column names

Index(['a1', 'a2', 'a3'], dtype='object')

In [183]:
df.index # to get information about indexes

RangeIndex(start=0, stop=3, step=1)

In [185]:
df['a1'].sum() #to sum particular Column

40

In [187]:
df.iloc[0].sum() #to sum particular Row

80

In [188]:
#how can we apply a function to a column in dataframe

def power2(x):
    return x**2

In [192]:
df['a1']

0    10
1    20
2    10
Name: a1, dtype: int64

In [191]:
df['a1'].apply(power2)

0    100
1    400
2    100
Name: a1, dtype: int64

In [193]:
df.iloc[1].apply(power2)

a1    400
a2    900
a3    100
Name: 1, dtype: int64

In [ ]:
#data io opetation

In [194]:
df=pd.read_csv(r'files/record.csv')
df

   RollNo  Name  Science  Maths  English  Percentage
0       1   Sam       60     65       50   58.333333
1       2  Tina       75     60       85   73.333333
2       3  Ravi       98     88       74   86.666667

In [195]:
#conversion of Data Frame
df.to_csv('My_output')

In [196]:
pd.read_csv('My_output')

   Unnamed: 0  RollNo  Name  Science  Maths  English  Percentage
0           0       1   Sam       60     65       50   58.333333
1           1       2  Tina       75     60       85   73.333333
2           2       3  Ravi       98     88       74   86.666667

In [197]:
df.to_csv('My_output',index=False)

In [198]:
pd.read_csv('My_output')

   RollNo  Name  Science  Maths  English  Percentage
0       1   Sam       60     65       50   58.333333
1       2  Tina       75     60       85   73.333333
2       3  Ravi       98     88       74   86.666667

In [202]:
df=pd.read_excel(r'files/record.xlsx')
df

   RollNo     Name  Science  Maths  English  Percentage Grade
0       1      Sam       60     65       50   58.333333     C
1       2     Tina       75     60       85   73.333333     B
2       3     Ravi       98     88       74   86.666667     A
3       4  Prateek       99    100       95   98.000000     A

In [203]:
df=pd.read_excel(r'files/record.xlsx',sheet_name='Sheet2')
df

     Name  Insurance
0    Ravi       3000
1  Kartik       5000
2   Pooja       9000

In [207]:
#Storing Dataframe to Excel

df.to_excel('files/Output_Excel.xlsx',index=False)

In [208]:
pd.read_excel(r'files/Output_Excel.xlsx')

     Name  Insurance
0    Ravi       3000
1  Kartik       5000
2   Pooja       9000